sergz72/ARM/atsamd11/atsamd11lib/component/eic.h
#define EIC_INTFLAG_EXTINT0_Pos               _UINT32_(0)                                          /* (EIC_INTFLAG) External Interrupt 0 Position */
#define EIC_INTFLAG_EXTINT0_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT0_Pos)           /* (EIC_INTFLAG) External Interrupt 0 Mask */
#define EIC_INTFLAG_EXTINT0(value)            (EIC_INTFLAG_EXTINT0_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT0_Pos)) /* Assigment of value for EXTINT0 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT1_Pos               _UINT32_(1)                                          /* (EIC_INTFLAG) External Interrupt 1 Position */
#define EIC_INTFLAG_EXTINT1_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT1_Pos)           /* (EIC_INTFLAG) External Interrupt 1 Mask */
#define EIC_INTFLAG_EXTINT1(value)            (EIC_INTFLAG_EXTINT1_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT1_Pos)) /* Assigment of value for EXTINT1 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT2_Pos               _UINT32_(2)                                          /* (EIC_INTFLAG) External Interrupt 2 Position */
#define EIC_INTFLAG_EXTINT2_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT2_Pos)           /* (EIC_INTFLAG) External Interrupt 2 Mask */
#define EIC_INTFLAG_EXTINT2(value)            (EIC_INTFLAG_EXTINT2_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT2_Pos)) /* Assigment of value for EXTINT2 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT3_Pos               _UINT32_(3)                                          /* (EIC_INTFLAG) External Interrupt 3 Position */
#define EIC_INTFLAG_EXTINT3_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT3_Pos)           /* (EIC_INTFLAG) External Interrupt 3 Mask */
#define EIC_INTFLAG_EXTINT3(value)            (EIC_INTFLAG_EXTINT3_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT3_Pos)) /* Assigment of value for EXTINT3 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT4_Pos               _UINT32_(4)                                          /* (EIC_INTFLAG) External Interrupt 4 Position */
#define EIC_INTFLAG_EXTINT4_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT4_Pos)           /* (EIC_INTFLAG) External Interrupt 4 Mask */
#define EIC_INTFLAG_EXTINT4(value)            (EIC_INTFLAG_EXTINT4_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT4_Pos)) /* Assigment of value for EXTINT4 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT5_Pos               _UINT32_(5)                                          /* (EIC_INTFLAG) External Interrupt 5 Position */
#define EIC_INTFLAG_EXTINT5_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT5_Pos)           /* (EIC_INTFLAG) External Interrupt 5 Mask */
#define EIC_INTFLAG_EXTINT5(value)            (EIC_INTFLAG_EXTINT5_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT5_Pos)) /* Assigment of value for EXTINT5 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT6_Pos               _UINT32_(6)                                          /* (EIC_INTFLAG) External Interrupt 6 Position */
#define EIC_INTFLAG_EXTINT6_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT6_Pos)           /* (EIC_INTFLAG) External Interrupt 6 Mask */
#define EIC_INTFLAG_EXTINT6(value)            (EIC_INTFLAG_EXTINT6_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT6_Pos)) /* Assigment of value for EXTINT6 in the EIC_INTFLAG register */
#define EIC_INTFLAG_EXTINT7_Pos               _UINT32_(7)                                          /* (EIC_INTFLAG) External Interrupt 7 Position */
#define EIC_INTFLAG_EXTINT7_Msk               (_UINT32_(0x1) << EIC_INTFLAG_EXTINT7_Pos)           /* (EIC_INTFLAG) External Interrupt 7 Mask */
#define EIC_INTFLAG_EXTINT7(value)            (EIC_INTFLAG_EXTINT7_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT7_Pos)) /* Assigment of value for EXTINT7 in the EIC_INTFLAG register */
#define EIC_INTFLAG_Msk                       _UINT32_(0x000000FF)                                 /* (EIC_INTFLAG) Register Mask  */

#define EIC_INTFLAG_EXTINT_Pos                _UINT32_(0)                                          /* (EIC_INTFLAG Position) External Interrupt 7 */
#define EIC_INTFLAG_EXTINT_Msk                (_UINT32_(0xFF) << EIC_INTFLAG_EXTINT_Pos)           /* (EIC_INTFLAG Mask) EXTINT */
#define EIC_INTFLAG_EXTINT(value)             (EIC_INTFLAG_EXTINT_Msk & (_UINT32_(value) << EIC_INTFLAG_EXTINT_Pos)) 

/* -------- EIC_WAKEUP : (EIC Offset: 0x14) (R/W 32) Wake-Up Enable -------- */
#define EIC_WAKEUP_RESETVALUE                 _UINT32_(0x00)                                       /*  (EIC_WAKEUP) Wake-Up Enable  Reset Value */

#define EIC_WAKEUP_WAKEUPEN0_Pos              _UINT32_(0)                                          /* (EIC_WAKEUP) External Interrupt 0 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN0_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN0_Pos)          /* (EIC_WAKEUP) External Interrupt 0 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN0(value)           (EIC_WAKEUP_WAKEUPEN0_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN0_Pos)) /* Assigment of value for WAKEUPEN0 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN1_Pos              _UINT32_(1)                                          /* (EIC_WAKEUP) External Interrupt 1 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN1_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN1_Pos)          /* (EIC_WAKEUP) External Interrupt 1 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN1(value)           (EIC_WAKEUP_WAKEUPEN1_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN1_Pos)) /* Assigment of value for WAKEUPEN1 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN2_Pos              _UINT32_(2)                                          /* (EIC_WAKEUP) External Interrupt 2 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN2_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN2_Pos)          /* (EIC_WAKEUP) External Interrupt 2 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN2(value)           (EIC_WAKEUP_WAKEUPEN2_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN2_Pos)) /* Assigment of value for WAKEUPEN2 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN3_Pos              _UINT32_(3)                                          /* (EIC_WAKEUP) External Interrupt 3 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN3_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN3_Pos)          /* (EIC_WAKEUP) External Interrupt 3 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN3(value)           (EIC_WAKEUP_WAKEUPEN3_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN3_Pos)) /* Assigment of value for WAKEUPEN3 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN4_Pos              _UINT32_(4)                                          /* (EIC_WAKEUP) External Interrupt 4 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN4_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN4_Pos)          /* (EIC_WAKEUP) External Interrupt 4 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN4(value)           (EIC_WAKEUP_WAKEUPEN4_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN4_Pos)) /* Assigment of value for WAKEUPEN4 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN5_Pos              _UINT32_(5)                                          /* (EIC_WAKEUP) External Interrupt 5 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN5_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN5_Pos)          /* (EIC_WAKEUP) External Interrupt 5 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN5(value)           (EIC_WAKEUP_WAKEUPEN5_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN5_Pos)) /* Assigment of value for WAKEUPEN5 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN6_Pos              _UINT32_(6)                                          /* (EIC_WAKEUP) External Interrupt 6 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN6_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN6_Pos)          /* (EIC_WAKEUP) External Interrupt 6 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN6(value)           (EIC_WAKEUP_WAKEUPEN6_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN6_Pos)) /* Assigment of value for WAKEUPEN6 in the EIC_WAKEUP register */
#define EIC_WAKEUP_WAKEUPEN7_Pos              _UINT32_(7)                                          /* (EIC_WAKEUP) External Interrupt 7 Wake-up Enable Position */
#define EIC_WAKEUP_WAKEUPEN7_Msk              (_UINT32_(0x1) << EIC_WAKEUP_WAKEUPEN7_Pos)          /* (EIC_WAKEUP) External Interrupt 7 Wake-up Enable Mask */
#define EIC_WAKEUP_WAKEUPEN7(value)           (EIC_WAKEUP_WAKEUPEN7_Msk & (_UINT32_(value) << EIC_WAKEUP_WAKEUPEN7_Pos)) /* Assigment of value for WAKEUPEN7 in the EIC_WAKEUP register */
#define EIC_WAKEUP_Msk                        _UINT32_(0x000000FF)                                 /* (EIC_WAKEUP) Register Mask  */

